nichiyama/qnote.org
#+TITLE:     10/11 進行状況
#+AUTHOR:    Nichiyama
#+EMAIL:     (concat "fniessen" at-sign "pirilampo.org")
#+DATE:      2018-10-11
#+LANGUAGE:  en
#+OPTIONS: ^:{}  H:4 num:nil toc:2

#+SETUPFILE: /Users/bob/org-html-themes/setup/theme-readtheorg.setup

#+begin_html
<div class="right">
  <a href="https://github.com/fniessen/org-html-themes/blob/master/demo/example.org" class="fa fa-github"> Edit on GitHub</a>
</div>
#+end_html

-----
* まずはじめに
- 計算手順があっているか確認するため，サンプルを作る．とのことでしたがそれ以前の問題で止まりまくりました．
- サンプルというよりは疑問集になりました．すみません．
- 日記のように日々やったことを記載していきますので，日本語おかしいかもしれません．すみません．

* 自分なりに整理して，ひとまず取り組みました.
** まず僕の中での手順，イメージの確認．そして疑問
- モデル->POSCARの作成,それをVESTAで確認．
- [POSCARってどうやって作成するんやろう．．．]
- POSCARの構造
  - l.3-5に格子ベクトル
  - l.6にMg, Zn, Yの原子すう
    -   195    9    12
#+begin_text
> grep PAW_PBE POTCAR
 PAW_PBE Mg 05Jan2001
   TITEL  = PAW_PBE Mg 05Jan2001
 PAW_PBE Zn 06Sep2000
   TITEL  = PAW_PBE Zn 06Sep2000
 PAW_PBE Y_sv 06Sep2000
   TITEL  = PAW_PBE Y_sv 06Sep2000
#+end_text
  - l.10-に原子位置
  - open -a vesta POSCAR
でvestaが開く．あとは調べて．
- 計算->
  - INCARの条件（IBRION,NELM,NSWの値）の設定.
  - KPOINTSしない
  - POTCAR 変更方法しない
  - POSCAR 変更方法を模索中
  [今後Zn,Yペアとして計算するのであればPOTCARを変更する必要があると思うがその方法？，そしてPOSCARと関連づける必要があるけどその方法？]

- 六方晶構造(hcp: hexagonal close packed) 基本並進ベクトル
       11.0813398361         0.0000000000         0.0000000000
       -5.5406699181         9.5967218060         0.0000000000
        0.0000000000         0.0000000000        46.7639999390

- 解析
- OUTCARをみる．-> ***.o***をみる
- 電子緩和と格子緩和(relax)を交互にする
- self-consistent loop $H \psi = e \psi$ 
- force力です．$F = \frac{dE}{dx}$ 

POSCARとCONTCARのdiff が通るか確認．

それからCONTCARの原子配置をVESTAでみてもさっぱりわからない？？？

[NSWが40で止まっているかなどはどこを確認する？
electric force でエネルギーのずれ？など言われた事が理解できていない．．．]




自分への考察->

んーわからん事が多すぎる．
とりあえず，IBRION,NELM,NSWについてVASPのマニュアルで確認しつつ，
計算をしてみよう．


そして大風邪発症で頭バグる．



** 計算手順を確認するためのサンプル

csl/MgZnY_Morishita/smallcluster_adding/full_relax
にあったドンキーさんのファイルをもとに再計算をかけました．

7-layerまであるファイルでしたが，
全部のlayerを計算し終わることはできなかったので，ここでは1-layerをサンプルとして確認することにします．

まず1-calcに入っている．INCAR,POSCAR,POTCAR,KPOINTSを拝見．
先生に注意するように言われた，INCARの"NSW"と"NELM"の値を見ました．

NSWを60，NELMを60にし，IBRION = 2 #Relax ions with conjugate-gradient
共役勾配法
で計算を行いました．


1-calcではdiffが通らなかったのでcp ../1-calc/CONTCAR POSCARとdiffが通るまで繰り返し，
1-layerでは4-calcまで計算を行ってdiff が通りました．

そして実際にVESTAでPOSCAR,CONTCARを開きましたが，何がなんだかわかりません，，，




* まとめQリスト


** VESTAの使い方および見方

ファイルをopenして原子配置を表示することはできたが，そもそも使い方と見方がよくわからない，，，
なのでそれに関連したPOSCARの作成の仕方がわからない．

** VASPについての質問集

POSCAR，CONTCARの変更方法がわからない．マニュアルに各数値の群がなにを意味するのか記載はしてあるが，，，理解できていない．．．

OUTCARでエネルギーのずれ？など，計算結果のエネルギー以外に注意しないといけないところがわかっていない．
