nichiyama/diary/November/qnote.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>10/11 進行状況</title>
<!-- 2018-10-11 木 15:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Nichiyama" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">10/11 進行状況</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">まずはじめに</a></li>
<li><a href="#sec-2">自分なりに整理して，ひとまず取り組みました.</a>
<ul>
<li><a href="#sec-2-1">まず僕の中での手順，イメージの確認．そして疑問</a></li>
<li><a href="#sec-2-2">計算手順を確認するためのサンプル</a></li>
</ul>
</li>
<li><a href="#sec-3">まとめQリスト</a>
<ul>
<li><a href="#sec-3-1">VESTAの使い方および見方</a></li>
<li><a href="#sec-3-2">VASPについての質問集</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="right">
  <a href="https://github.com/fniessen/org-html-themes/blob/master/demo/example.org" class="fa fa-github"> Edit on GitHub</a>
</div>

<hr  />
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">まずはじめに</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>計算手順があっているか確認するため，サンプルを作る．とのことでしたがそれ以前の問題で止まりまくりました．
</li>
<li>サンプルというよりは疑問集になりました．すみません．
</li>
<li>日記のように日々やったことを記載していきますので，日本語おかしいかもしれません．すみません．
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">自分なりに整理して，ひとまず取り組みました.</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">まず僕の中での手順，イメージの確認．そして疑問</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>モデル-&gt;POSCARの作成,それをVESTAで確認．
</li>
<li>[POSCARってどうやって作成するんやろう．．．]
</li>
<li>POSCARの構造
<ul class="org-ul">
<li>l.3-5に格子ベクトル
</li>
<li>l.6にMg, Zn, Yの原子すう
<ul class="org-ul">
<li>195    9    12
</li>
</ul>
</li>
</ul>
</li>
</ul>
<div class="text">
<p>
&gt; grep PAW_PBE POTCAR
 PAW_PBE Mg 05Jan2001
   TITEL  = PAW_PBE Mg 05Jan2001
 PAW_PBE Zn 06Sep2000
   TITEL  = PAW_PBE Zn 06Sep2000
 PAW_PBE Y_sv 06Sep2000
   TITEL  = PAW_PBE Y_sv 06Sep2000
</p>

</div>
<ul class="org-ul">
<li>l.10-に原子位置
</li>
<li>open -a vesta POSCAR
</li>
</ul>
<p>
でvestaが開く．あとは調べて．
</p>
<ul class="org-ul">
<li>計算-&gt;
<ul class="org-ul">
<li>INCARの条件（IBRION,NELM,NSWの値）の設定.
</li>
<li>KPOINTSしない
</li>
<li>POTCAR 変更方法しない
</li>
<li>POSCAR 変更方法を模索中
</li>
</ul>
<p>
[今後Zn,Yペアとして計算するのであればPOTCARを変更する必要があると思うがその方法？，そしてPOSCARと関連づける必要があるけどその方法？]
</p>
</li>

<li>六方晶構造(hcp: hexagonal close packed) 基本並進ベクトル
11.0813398361         0.0000000000         0.0000000000
-5.5406699181         9.5967218060         0.0000000000
 0.0000000000         0.0000000000        46.7639999390
</li>

<li>解析
</li>
<li>OUTCARをみる．-&gt; <b>*</b>.o***をみる
</li>
<li>電子緩和と格子緩和(relax)を交互にする
</li>
<li>self-consistent loop \(H \psi = e \psi\)
</li>
<li>force力です．\(F = \frac{dE}{dx}\)
</li>
</ul>

<p>
POSCARとCONTCARのdiff が通るか確認．
</p>

<p>
それからCONTCARの原子配置をVESTAでみてもさっぱりわからない？？？
</p>

<p>
[NSWが40で止まっているかなどはどこを確認する？
electric force でエネルギーのずれ？など言われた事が理解できていない．．．]
</p>




<p>
自分への考察-&gt;
</p>

<p>
んーわからん事が多すぎる．
とりあえず，IBRION,NELM,NSWについてVASPのマニュアルで確認しつつ，
計算をしてみよう．
</p>


<p>
そして大風邪発症で頭バグる．
</p>
</div>
</div>



<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">計算手順を確認するためのサンプル</h3>
<div class="outline-text-3" id="text-2-2">
<p>
csl/MgZnY_Morishita/smallcluster_adding/full_relax
にあったドンキーさんのファイルをもとに再計算をかけました．
</p>

<p>
7-layerまであるファイルでしたが，
全部のlayerを計算し終わることはできなかったので，ここでは1-layerをサンプルとして確認することにします．
</p>

<p>
まず1-calcに入っている．INCAR,POSCAR,POTCAR,KPOINTSを拝見．
先生に注意するように言われた，INCARの"NSW"と"NELM"の値を見ました．
</p>

<p>
NSWを60，NELMを60にし，IBRION = 2 #Relax ions with conjugate-gradient
共役勾配法
で計算を行いました．
</p>


<p>
1-calcではdiffが通らなかったのでcp ../1-calc/CONTCAR POSCARとdiffが通るまで繰り返し，
1-layerでは4-calcまで計算を行ってdiff が通りました．
</p>

<p>
そして実際にVESTAでPOSCAR,CONTCARを開きましたが，何がなんだかわかりません，，，
</p>
</div>
</div>
</div>




<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">まとめQリスト</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">VESTAの使い方および見方</h3>
<div class="outline-text-3" id="text-3-1">
<p>
ファイルをopenして原子配置を表示することはできたが，そもそも使い方と見方がよくわからない，，，
なのでそれに関連したPOSCARの作成の仕方がわからない．
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">VASPについての質問集</h3>
<div class="outline-text-3" id="text-3-2">
<p>
POSCAR，CONTCARの変更方法がわからない．マニュアルに各数値の群がなにを意味するのか記載はしてあるが，，，理解できていない．．．
</p>

<p>
OUTCARでエネルギーのずれ？など，計算結果のエネルギー以外に注意しないといけないところがわかっていない．
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-11</p>
<p class="author">Author: Nichiyama</p>
<p class="date">Created: 2018-10-11 木 15:47</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
